url - https://en.wikipedia.org/wiki/India
paragraph - India, officially the Republic of India (Hindi: Bhārat Gaṇarājya),[24] is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west;[f] China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand, Myanmar and Indonesia.

url - https://en.wikipedia.org/wiki/Culture_of_India
paragraph - Indian culture is the heritage of social norms, ethical values, traditional customs, belief systems, political systems, artifacts and technologies that originated in or are associated with the ethno-linguistically diverse Indian subcontinent. The term also applies beyond India to countries and cultures whose histories are strongly connected to India by immigration, colonization, or influence, particularly in South Asia and Southeast Asia. India's languages, religions, dance, music, architecture, food and customs differ from place to place within the country.

url - https://en.wikipedia.org/wiki/Climate_of_India
paragraph - The Climate of India consists of a wide range of weather conditions across a vast geographic scale and varied topography, making generalizations difficult. Based on the Köppen system, India hosts six major climatic sub types, ranging from arid deserts in the west, alpine tundra and glaciers in the north, and humid tropical regions supporting rain forests in the southwest and the island territories. Many regions have starkly different microclimates, making it one of the most climatically diverse countries in the world. The country's meteorological department follows the international standard of four seasons with some local adjustments: winter (January and February), summer (March, April and May), monsoon (rainy) season (July to August), and a post-monsoon period (October to December).

url - https://en.wikipedia.org/wiki/State_Emblem_of_India
paragraph - The State Emblem of India is the national emblem of India and is used by the union government, many state governments and government agencies. The emblem is an adaptation of the Lion Capital of Ashoka, a statue from 280 BCE. The statue is a dimensional emblem showing four 
lions. It became the emblem of the Dominion of India in December 1947,[1] and later the emblem of the Republic of India.

url - https://en.wikipedia.org/wiki/The_Times_of_India
paragraph - The Times of India (also known by its abbreviation 'TOI') is an Indian English-language daily newspaper and digital news media owned and managed by The Times Group. It is the third-largest newspaper in India by circulation and largest selling English-language daily in the world.[2][3][4][5][1][6] It is the oldest English-language newspaper in India, and the second-oldest Indian newspaper still in circulation, with its first edition published in 1838.[7] It is nicknamed as "The Old Lady of Bori Bunder",[8][9] and is an Indian "newspaper of record".[10][11]

url - https://en.wikipedia.org/wiki/Supreme_Court_of_India
paragraph - The Supreme Court of India (IAST: Bhāratīya Ucchatama Nyāyālaya) is the supreme judicial body of India and the highest court of the Republic of India under the constitution. It is the most senior constitutional court, and has the power of judicial review. The Chief Justice of India is the head and chief judge of the Supreme Court, which consists of a maximum of 34 judges and has extensive powers in the form of original, appellate and advisory jurisdictions.[3]

url - https://en.wikipedia.org/wiki/South_India
paragraph - South India is a region consisting of the southern part of India, which encompasses the Indian states of Andhra Pradesh, Karnataka, Kerala, Tamil Nadu, and Telangana, as well as the union territories of Lakshadweep and Puducherry, comprising 19.31% of India's area (635,780 km2 or 245,480 sq mi) and 20% of India's population. Covering the southern part of the peninsular Deccan Plateau, South India is bounded by the Bay of Bengal in the east, the Arabian Sea in the west and the Indian Ocean in the south. The geography of the region is diverse with two mountain ranges – the Western and Eastern Ghats – bordering the plateau heartland. The Godavari, Krishna, Kaveri, Tungabhadra, Periyar River, Bharathappuzha River, Thamirabarani, Palar and Vaigai rivers are important non-perennial sources of water.

url - https://en.wikipedia.org/wiki/Partition_of_India
paragraph - The partition of India was the division of British India[c] in 1947 into two independent Dominions: India and Pakistan.[6] The Dominion of India is today the Republic of India, and the Dominion of Pakistan is the Islamic Republic of Pakistan and the People's Republic of Bangladesh. The partition involved the division of two provinces, Bengal and Punjab, based on district-wide non-Muslim or Muslim majorities. The partition also saw the division of the British Indian Army, the Royal Indian Navy, the Royal Indian Air Force, the Indian Civil Service, the railways, and the central treasury. The partition was outlined in the Indian Independence Act 1947 and resulted in the dissolution of the British Raj, i.e. Crown rule in India. The two self-governing independent Dominions of India and Pakistan legally came into existence at midnight on 15 August 1947.

url - https://en.wikipedia.org/wiki/Chief_Justice_of_India
paragraph - The chief justice of India (IAST: Bhārat Gaṇarājya ke Mukhya Nyāyādhīśa), officially the chief justice of the Supreme Court of India, is the chief judge of the Supreme Court of India as well as the highest-ranking officer of the Indian federal judiciary. The Constitution of India grants power to the president of India to appoint, in consultation with the outgoing chief justice, the next chief justice, who will serve until they reach the age of sixty-five or are removed by impeachment. As per convention, the name suggested by the incumbent chief justice is almost always the next senior most judge in the Supreme Court.

url - https://en.wikipedia.org/wiki/%C3%8Dndia
paragraph - Índia is the fourth studio album by Brazilian singer Gal Costa, released on 1973 by Philips Records. Its major hits were "Índia", "Volta" and "Desafinado".[2][3][4]

url - https://en.wikipedia.org/wiki/Poverty_in_India
paragraph - India is a developing nation. Although its economy is growing, poverty is still a major challenge. However, poverty is on the decline in India. It has around 84 million people living in extreme poverty which makes up ~6% of its total population as of May 2021. However, the COVID-19 pandemic is expected to drive an additional people into extreme poverty, Depending on the severity of the economic contraction.
Poverty, defined as living on less than $1.90 a day, affected between 9.1% and 9.4% of the world's population in 2020, according to the biennial Poverty and Shared Prosperity Report. This would represent a regression to the rate of 9.2% in 2017. Had the pandemic not disrupted the global economy, this rate was expected to drop to 7.9% in 2020.[1] In May 2012, the World Bank reviewed and proposed revisions to their poverty calculation methodology and purchasing power parity basis for measuring poverty worldwide.[1] It was a minimal 3.6% in terms of percentage. As of 2020, the incidence of multidimensional poverty has significantly reduced from 54.7% in 2005 to 27.9% in 2015–2016.[2] According to United Nations Development Programme administrator Achim Steiner, India lifted 271 million people out of extreme poverty in a 10-year time period from 2005–2006 to 2015–2016. A 2020 study from the World Economic Forum found "Some 220 million Indians sustained on an expenditure level of less than Rs 32 / day—the poverty line for rural India—by the last headcount of the poor in India in 2013."[3]

url - https://en.wikipedia.org/wiki/Femina_Miss_India
paragraph - Miss India or Femina Miss India is a national beauty pageant in India that annually selects representatives to compete in Miss World, one of the Big Four major international beauty pageants.[1] It is organised by Femina, a women's magazine published by The Times Group. Since 2013, Femina also organizes Miss Diva separately which sends representatives to Miss Universe.[2][3]

url - https://en.wikipedia.org/wiki/Vice_President_of_India
paragraph - The vice president of India (IAST: Bhārat kē Uparāṣṭrapati), officially the vice president of the Republic of India, is the deputy to the head of state of India, the president of the republic . The Vice president is the second highest constitutional office after the president and ranks first in the presidential line of succession. The vice president is also an officer of the legislative branch of the Union Government as the chair of the Council of State.

url - https://en.wikipedia.org/wiki/Governor-General_of_India
paragraph - The Governor-General of India (1773–1950, from 1858 to 1947 the Viceroy and Governor-General of India, commonly shortened to Viceroy of India) was the representative of the Monarch of the United Kingdom and after Indian independence in 1947, the representative of the Indian head of state. The office was created in 1773, with the title of Governor-General of the Presidency of Fort William. The officer had direct control only over Fort William but supervised other East India Company officials in India. Complete authority over all of India was granted in 1833, and the official came to be known as the "Governor-General of India".

url - https://en.wikipedia.org/wiki/List_of_airlines_of_India
paragraph - This is a list of airlines which have an air operator's certificate issued by the Directorate General of Civil Aviation of India.

url - https://en.wikipedia.org/wiki/List_of_prime_ministers_of_India
paragraph - The Prime Minister is the chief executive officer of the government of India. In India's parliamentary system, the Constitution names the president as the head of state de jure, but his or her de facto executive powers are vested in the prime minister and their Council of Ministers. Appointed and sworn in by the President, the prime minister is usually the leader of the party or alliance that has a majority in the Lok Sabha, the lower house of Parliament of India.[1]

url - https://en.wikipedia.org/wiki/Education_in_India
paragraph - Education in India is primarily managed by state-run public education system, which fall under the command of the government at three levels: Central, state and local. Under various articles of the Indian Constitution and the Right of Children to Free and Compulsory Education Act, 2009, free and compulsory education is provided as a fundamental right to children aged 6 to 14. The approximate ratio of public schools to private schools in India is 7:5. Major policy initiatives in Indian education are numerous. Up until 1976, education policies and implementation were determined legally by each of India’s constitutional states. The 42nd amendment to the constitution in 1976 made education a ‘concurrent subject’. From this point on the central and state governments shared formal responsibility for funding and administration of education. In a country as large as India, now with 28 states and eight union territories, this means that the potential for variations between states in the policies, plans, programs and initiatives for elementary education is vast. Periodically, national policy frameworks are created to guide states in their creation of state-level programs and policies. State governments and local government bodies manage the majority of primary and upper primary schools and the number of government-managed elementary schools is growing. Simultaneously the number and proportion managed by private bodies is growing. In 2005-6 83.13% of schools offering elementary education (Grades 1-8) were managed by government and 16.86% of schools were under private management (excluding children in unrecognised schools, schools established under the Education Guarantee Scheme and in alternative learning centers). Of those schools managed privately, one third are ‘aided’ and two thirds are ‘unaided’. Enrolment in Grades 1-8 is shared between government and privately managed schools in the ratio 73:27. However in rural areas this ratio is higher (80:20) and in urban areas much lower (36:66).[7]

url - https://en.wikipedia.org/wiki/List_of_national_parks_of_India
paragraph - National parks in India are IUCN category II protected areas. India's first national park was established in 1936 as Hailey National Park , now known as RAM GANGA National Park, Uttarakhand. By 1970, India only had five national parks. In 1972, India enacted the Wildlife Protection Act and Project Tiger in 1973 to safeguard the habitats of conservation reliant species.

url - https://en.wikipedia.org/wiki/List_of_presidents_of_India
paragraph - The president of India is the head of state of India and the Supreme Commander of the Indian Armed Forces. The president is referred to as the first citizen of India.[1][2] Although vested with these powers by the Constitution of India, the position is largely a ceremonial one and executive powers are de facto exercised by the prime minister.[3]

url - https://en.wikipedia.org/wiki/Election_Commission_of_India
paragraph - The Election Commission of India (ECI) is an autonomous body under the ownership of Ministry of Law and Justice, Government of India. It is established by the Constitution of India directly to ensure free and fair elections in the country. Article 324 of the Constitution provides that the power of superintendence, direction, and control of elections to parliament, state legislatures, the office of the president of India, and the office of vice-president of India shall be vested in the election commission. Thus, the Election Commission is an all-India body in the sense that it is common to both the Central government and the state governments.[3]

url - https://en.wikipedia.org/wiki/British_Raj
paragraph - The British Raj (/rɑːdʒ/; from Hindi rāj: kingdom, realm, state, or empire.[2][a]) was the rule of the British Crown on the Indian subcontinent from 1858 to 1947.[4][5][6][7] The rule is also called Crown rule in India,[8] or direct rule in India.[9] The region under British control was commonly called India in contemporaneous usage and included areas directly administered by the United Kingdom, which were collectively called British India, and areas ruled by indigenous rulers, but under British paramountcy, called the princely states. The region was sometimes called the Indian Empire, though not officially.[10]

url - https://en.wikipedia.org/wiki/British_colonial_India
paragraph - The British Raj (/rɑːdʒ/; from Hindi rāj: kingdom, realm, state, or empire.[2][a]) was the rule of the British Crown on the Indian subcontinent from 1858 to 1947.[4][5][6][7] The rule is also called Crown rule in India,[8] or direct rule in India.[9] The region under British control was commonly called India in contemporaneous usage and included areas directly administered by the United Kingdom, which were collectively called British India, and areas ruled by indigenous rulers, but under British paramountcy, called the princely states. The region was sometimes called the Indian Empire, though not officially.[10]

url - https://en.wikipedia.org/wiki/Portuguese_India
paragraph - The State of India (Portuguese: Estado da Índia), also referred as the Portuguese State of India (Estado Português da Índia, EPI) or simply Portuguese India (Índia Portuguesa), was a colonial state of the Portuguese Empire founded six years after the discovery of a sea route to the Indian subcontinent by the Kingdom of Portugal. The capital of Portuguese India served as the governing centre of a string of Portuguese fortresses and settlements scattered along the Indian Ocean.

url - https://en.wikipedia.org/wiki/Parliament_of_India
paragraph - The Parliament of India (IAST: Bhāratīya Sansad) is the supreme legislative body of the Republic of India. It is a bicameral legislature composed of the President of India and the two houses: the Rajya Sabha (House of States) and the Lok Sabha (House of the People). The President in his role as head of legislature has full powers to summon and prorogue either the House of Parliament or to dissolve the Lok Sabha. The president can exercise these powers only upon the advice of the Prime Minister and his Union Council of Ministers.

url - https://en.wikipedia.org/wiki/Geography_of_India
paragraph - India is situated north of the equator between 8°4' north (the mainland) to 37°6' north latitude and 68°7' east to 97°25' east longitude.[2] It is the seventh-largest country in the world, with a total area of 3,287,263 square kilometres (1,269,219 sq mi).[3][4][5] India measures 3,214 km (1,997 mi) from north to south and 2,933 km (1,822 mi) from east to west. It has a land frontier of 15,200 km (9,445 mi) and a coastline of 7,516.6 km (4,671 mi).[1]

url - https://en.wikipedia.org/wiki/Union_budget_of_India
paragraph - The Union Budget of India, also referred to as the Annual Financial Statement in Article 112 of the Constitution of India,[1] is the annual budget of the Republic of India. The Government presents it on the first day of February so that it could be materialised before the beginning of new financial year in April. Until 2016 it was presented on the last working day of February by the Finance Minister in Parliament. The budget division of the department of economic affairs (DEA) in the finance ministry is the nodal body responsible for producing the budget[2]. It is presented by means of the Finance bill and the Appropriation bill has to be passed by Lok Sabha before it can come into effect on 1 April, the start of India's financial year.

url - https://en.wikipedia.org/wiki/Reserve_Bank_of_India
paragraph - The Reserve Bank of India (RBI) is India's central bank and regulatory body and is responsible for the issue and supply of the Indian rupee and the regulation of the Indian banking system. It also manages the country's main payment systems and works to promote its economic development. Bharatiya Reserve Bank Note Mudran is one of the specialised divisions of RBI through which it mints Indian bank notes and coins. RBI established the National Payments Corporation of India as one of its specialised division to regulate the payment and settlement systems in India. Deposit Insurance and Credit Guarantee Corporation was established by RBI as one of its specialised division for the purpose of providing insurance of deposits and guaranteeing of credit facilities to all Indian banks.

url - https://en.wikipedia.org/wiki/Presidencies_and_provinces_of_British_India
paragraph - The Provinces of India, earlier Presidencies of British India and still earlier, Presidency towns, were the administrative divisions of British governance in the Indian subcontinent. Collectively, they have been called British India. In one form or another, they existed between 1612 and 1947, conventionally divided into three historical periods:

url - https://en.wikipedia.org/wiki/COVID-19_pandemic_in_India
paragraph - The COVID-19 pandemic in India is a part of the worldwide pandemic of coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). As of 20 January 2022[update], according to official figures, India has the second-highest number of confirmed cases in the world (after the United States of America) with 42,188,138[4] reported cases of COVID-19 infection and the third-highest number of COVID-19 deaths (after the United States and Brazil) at 501,979[4] deaths.[6][7][8] However these figures exhibit severe under-reporting.[9][10]

url - https://en.wikipedia.org/wiki/Constituent_Assembly_of_India
paragraph - The Constituent Assembly of India was elected to frame the Constitution of India. It was elected by the 'Provincial Assembly'. Following India's independence from British Government in 1947, its members served as the nation's first Parliament.

url - https://en.wikipedia.org/wiki/Chief_Election_Commissioner_of_India
paragraph - The Chief Election Commissioner of India heads the Election Commission of India, a body constitutionally empowered to conduct free and fair elections to the national and state legislatures and of President and Vice-President. This power of the Election Commission of India is derived from the Article 324 of the Constitution of India. Chief Election Commissioner of India is usually a member of the Indian Civil Service and mostly from the Indian Administrative Service. It is very difficult to remove the authority of the Chief Election Commissioner once appointed by the president, as two-thirds of the Lok Sabha and the Rajya Sabha need to present and vote against him for disorderly conduct or improper actions.

url - https://en.wikipedia.org/wiki/State_legislative_assemblies_of_India
paragraph - The State Legislative Assembly, or Vidhan Sabha,[1] or also Saasana Sabha, is a legislative body in the states and union territories of India. In the 28 states and 3 union territories with a unicameral state legislature, it is the sole legislative body and in 6 states it is the lower house of their bicameral state legislatures with the upper house being State Legislative Council. 5 union territories are governed directly by the Union Government of India and have no legislative body.

url - https://en.wikipedia.org/wiki/Prime_Minister_of_India
paragraph - The prime minister of India (IAST: Bhārat ke Pradhānamantrī), officially the prime minister of the Republic of India is the head of the executive branch of the government of India. The prime minister is the presiding member of the Council of Ministers of the central government and heads the federal cabinet. They can be a member of any of the two houses of the Parliament of India—the Lok Sabha (House of the People) and the Rajya Sabha (Council of the States); but has to be a member of the political party or coalition, having a majority in the Lok Sabha.

url - https://en.wikipedia.org/wiki/Quit_India_Movement
paragraph - The Quit India Movement, also known as the August Movement, was a movement launched at the Bombay session of the All India Congress Committee by Mahatma Gandhi on 8 August 1942, during World War II, demanding an end to British rule in India.

url - https://en.wikipedia.org/wiki/Life_Insurance_Corporation
paragraph - Life Insurance Corporation of India (LIC) is an Indian statutory insurance and investment corporation headquartered in the city of Mumbai, India. It is under the ownership of Ministry of Finance, Government of India.

url - https://en.wikipedia.org/wiki/Life_Insurance_Corp._of_India
paragraph - Life Insurance Corporation of India (LIC) is an Indian statutory insurance and investment corporation headquartered in the city of Mumbai, India. It is under the ownership of Ministry of Finance, Government of India.

url - https://en.wikipedia.org/wiki/State_Bank_of_India
paragraph - State Bank of India (SBI) is an Indian multinational public sector bank and financial services statutory body headquartered in Mumbai, Maharashtra. SBI is the 43rd largest bank in the world and ranked 221st in the Fortune Global 500 list of the world's biggest corporations of 2020, being the only Indian bank on the list.[6] It is a public sector bank and the largest bank in India with a 23% market share by assets and a 25% share of the total loan and deposits market.[7] It is also the fifth largest employer in India with nearly 250,000 employees.[8][9][10]

url - https://en.wikipedia.org/wiki/Communist_Party_of_India
paragraph - The Communist Party of India (CPI) is the oldest communist party in India and one of the eight national parties in the country.[5] The CPI was founded in Kanpur on 26 December 1925.[2][6][7]

url - https://en.wikipedia.org/wiki/Republic_Day_(India)
paragraph - Republic Day is a public holiday in India, when the country marks and celebrates the date on which the Constitution of India came into effect on 26 January 1950, replacing the Government of India Act 1935 as the governing document of India and thus, turning the nation into a newly formed republic.[1] The day also marks the transition of India from an autonomous Commonwealth realm with British Monarch as nominal head of the Indian Dominion, to a fully sovereign republic in the Commonwealth of Nations with the President of India as the nominal head of the Indian Union.

url - https://en.wikipedia.org/wiki/Sony_Entertainment_Television
paragraph - Sony Entertainment Television (SET) is an Indian Hindi-language general entertainment pay television channel, that was launched on 30 September 1995, and is owned by Sony Pictures Networks India, a subsidiary of the Japanese Sony.[2]

url - https://en.wikipedia.org/wiki/Sony_Entertainment_Television(India)
paragraph - Sony Entertainment Television (SET) is an Indian Hindi-language general entertainment pay television channel, that was launched on 30 September 1995, and is owned by Sony Pictures Networks India, a subsidiary of the Japanese Sony.[2]

url - https://en.wikipedia.org/wiki/Names_for_India
paragraph - The Republic of India has two principal short names in both official and popular usage, each of which is historically significant, "India" and "Bharata". The first article of the Constitution of India states that "India, that is Bharat, shall be a union of states," implicitly codifying "India" and "Bharata" (Hindi: भारत, romanized: Bhārata) as equally official short names for the Republic of India. A third name, "Hindustān", is sometimes an alternative name for the region comprising most of the modern Indian states of the subcontinent when Indians speak among themselves. The usage of "Bhārat", "Hindustān", or "India" depends on the context and language of conversation.

url - https://en.wikipedia.org/wiki/India_at_the_Olympics
paragraph - India first participated at the Olympic Games in 1900, with a lone athlete Norman Pritchard winning two medals – both silver – in athletics and became the first Asian nation to win an Olympic medal.[1]

url - https://en.wikipedia.org/wiki/Union_Council_of_Ministers
paragraph - The Union Council of Ministers exercises executive authority in the Republic of India.[1] It consists of Cabinet Ministers, Minister of State and Ministers of State (Independent Charge). The council is led by the Prime Minister of India.

url - https://en.wikipedia.org/wiki/Union_Cabinet_of_India
paragraph - The Union Council of Ministers exercises executive authority in the Republic of India.[1] It consists of Cabinet Ministers, Minister of State and Ministers of State (Independent Charge). The council is led by the Prime Minister of India.

url - https://en.wikipedia.org/wiki/Caste_system_in_India
paragraph - Castes are rigid social groups characterized by hereditary transmission of life style, occupation and social status. The caste system in India has its origins in ancient India, and was transformed by various ruling elites in medieval, early-modern, and modern India, especially the Mughal Empire and the British Raj.[1][2][3][4] The caste system consists of two different concepts, varna and jati, which may be regarded as different levels of analysis.

url - https://en.wikipedia.org/wiki/India_national_cricket_team
paragraph - The India men's national cricket team, also known as Team India or the Men in Blue,[10] represents India in men's international cricket. It is governed by the Board of Control for Cricket in India (BCCI), and is a Full Member of the International Cricket Council (ICC) with Test, One Day International (ODI) and Twenty20 International (T20I) status.

url - https://en.wikipedia.org/wiki/Tourism_in_India
paragraph - Tourism in India is important for the country's economy and is growing rapidly. The World Travel and Tourism Council calculated that tourism generated ₹16.91 lakh crore (US$220 billion) or 9.2% of India's GDP in 2018 and supported 42.673 million jobs, 8.1% of its total employment.[1] The sector is predicted to grow at an annual rate of 6.9% to ₹32.05 lakh crore (US$430 billion) by 2028 (9.9% of GDP).[2] In October 2015, India's medical tourism sector was estimated to be worth US$3 billion, and it is projected to grow to US$7–8 billion by 2020.[3] In 2014, 184,298 foreign patients travelled to India to seek medical treatment.[4]

url - https://en.wikipedia.org/wiki/Dominion_of_India
paragraph - The Dominion of India,[4] officially the Union of India,[5][6][7] was an independent dominion in the British Commonwealth of Nations existing between 15 August 1947 and 26 January 1950.[8] Until its creation, the Indian subcontinent, commonly called "India" in contemporary usage, had been ruled as an informal empire by the United Kingdom.  The empire, also called the British Raj and sometimes the British Indian Empire, consisted of regions, collectively called British India, that were directly administered by the British government, and regions, called the princely states, that were ruled by Indian rulers under a system of paramountcy. The Dominion of India was formalised by the passage of the Indian Independence Act 1947, which also formalised an independent Dominion of Pakistan—comprising the regions of British India that are today Pakistan and Bangladesh. The Dominion of India remained "India" in common parlance but was geographically reduced. Under the Act, the British government relinquished all responsibility for administering its former territories. The government also revoked its treaty rights with the rulers of the princely states and advised them to join in a political union with India or Pakistan. Accordingly, the British monarch's regnal title, "Emperor of India," was abandoned.[7]

url - https://en.wikipedia.org/wiki/Gateway_of_India
paragraph - The Gateway of India is an arch-monument built in the early 20th century in the city of Mumbai,also known as Bombay,India. It was erected to commemorate the landing of King-Emperor George V, the first British monarch to visit India, in December 1911 at Ramchandani Road near Shyamaprasad Mukherjee Chowk in Mumbai.

url - https://en.wikipedia.org/wiki/Trinamool_Congress
paragraph - The All India Trinamool Congress (Bengali: All India Grassroots Congress;[4] abbr. AITC), colloquially the Trinamool Congress (abbr. TMC) is an Indian political party which is predominantly active in West Bengal.[5] The party is led by Mamata Banerjee, the current Chief Minister of West Bengal, who has led the state since 2011. It is currently the fifth-largest party in the Lok Sabha with 22 seats.[6] In 2016 the Election Commission recognized TMC as a national political party.[7][8]

url - https://en.wikipedia.org/wiki/All_India_Trinamool_Congress
paragraph - The All India Trinamool Congress (Bengali: All India Grassroots Congress;[4] abbr. AITC), colloquially the Trinamool Congress (abbr. TMC) is an Indian political party which is predominantly active in West Bengal.[5] The party is led by Mamata Banerjee, the current Chief Minister of West Bengal, who has led the state since 2011. It is currently the fifth-largest party in the Lok Sabha with 22 seats.[6] In 2016 the Election Commission recognized TMC as a national political party.[7][8]

url - https://en.wikipedia.org/wiki/Indian_people
paragraph - Indians are the nationals and citizens of India, the second most populous nation in the world, containing 17.50% of the world's population. In India, the term "Indian" refers to nationality, rather than a particular ethnicity or language; the Indian nationality consists of dozens of regional ethno-linguistic groups, reflecting the rich and complex history of the region. Due to emigration, the Indian diaspora is present throughout the world, notably in other parts of Asia, North America, Europe, the Caribbean, Oceania, and Africa.[4] The demonym Indian applies to nationals of the present-day Republic of India, but also to people residing outside of India, who are called Overseas Indians; before the partition of India in 1947, the demonym applied to all nationals residing in the entirety of British India (including what is now Pakistan and Bangladesh).[25][26]

url - https://en.wikipedia.org/wiki/People_of_India
paragraph - Indians are the nationals and citizens of India, the second most populous nation in the world, containing 17.50% of the world's population. In India, the term "Indian" refers to nationality, rather than a particular ethnicity or language; the Indian nationality consists of dozens of regional ethno-linguistic groups, reflecting the rich and complex history of the region. Due to emigration, the Indian diaspora is present throughout the world, notably in other parts of Asia, North America, Europe, the Caribbean, Oceania, and Africa.[4] The demonym Indian applies to nationals of the present-day Republic of India, but also to people residing outside of India, who are called Overseas Indians; before the partition of India in 1947, the demonym applied to all nationals residing in the entirety of British India (including what is now Pakistan and Bangladesh).[25][26]

url - https://en.wikipedia.org/wiki/Expressways_of_India
paragraph - Expressways are the highest class of roads in India. As of January 2022, India has a total of 2,074.5 km (1,289 mi) expressways. These are controlled-access highways where entrance and exits are controlled by the use of ramps that are incorporated into the design of the expressway, whereas National highways are at-grade roads. Some roads are not access-controlled expressway, but are still officially called expressways, such as the Biju Expressway, Ranchi Hazaribagh Expressway and Raipur–Bilaspur Expressway. Currently, the longest expressway in India is the Purvanchal Expressway at 340.8 km (211.8 mi) and the widest expressway is the Delhi–Meerut Expressway at 14 lanes.

url - https://en.wikipedia.org/wiki/India_Is
paragraph - India Is is a series of photography and video challenges organized by the Public Diplomacy Division (PDD) of the Ministry of External Affairs (MEA), Government of India.[1][2] Both of the contests invite photo and video entries, respectively, on given themes.[3]

url - https://en.wikipedia.org/wiki/List_of_states_and_union_territories_of_India_by_area
paragraph - The list of states and union territories of the Republic of India by area is ordered from largest to smallest according to the census of 2011. India consists of 28 states and 8 union territories, including the National Capital Territory of Delhi.[1][2][3]

url - https://en.wikipedia.org/wiki/India_pale_ale
paragraph - The style of pale ale which became known as India pale ale was widespread in England by 1815,[3] and would grow in popularity, notably as an export beer shipped to India (which was under the control of the  British East India Company until 1858) and elsewhere.[1][2][4][5]

url - https://en.wikipedia.org/wiki/North_India
paragraph - North India is a loosely defined region consisting of the northern part of India. The dominant geographical features of North India are the Indus-Gangetic Plain and the Himalayas, which demarcate the region from the Tibetan Plateau and Central Asia.

url - https://en.wikipedia.org/wiki/Minister_of_Finance_(India)
paragraph - The Minister of Finance (Vitt Mantrī ) (or simply, the Finance Minister, short form FM) is the head of the Ministry of Finance of the Government of India. One of the senior-most offices in the Union Cabinet, the finance minister is responsible for the fiscal policy of the government. As part of this, a key duty of the Finance Minister is to present the annual Union Budget in Parliament, which details the government's plan for taxation and spending in the coming financial year. Through the Budget, the finance minister also outlines the allocations to different ministries and departments. Occasionally, s/he is assisted by the Minister of State for Finance and the lower-ranked Deputy Minister of Finance.

url - https://en.wikipedia.org/wiki/List_of_states_and_union_territories_of_India_by_population
paragraph - India is a union of 28 states and 8 union territories.[1] As of 2011, with an estimated population of 1.2 billion, India is the world's second most populous country after the People's Republic of China. India occupies 2.4% of the world's area and is home to 17.5% of the world's population.[2] The Indo-Gangetic plains have one of the world's biggest stretches of fertile flat-deep alluvium and are among the most densely populated areas of the world. The eastern and western coastal regions of Deccan Plateau are also densely populated regions of India. The Thar Desert in western Rajasthan is one of the most densely populated deserts in the world.[3] The northern and north-eastern states along the Himalayas contain cold arid deserts with fertile valleys. These states have relatively less population density due to indomitable physical barriers.[4]

url - https://en.wikipedia.org/wiki/List_of_districts_in_India
paragraph - A district (zilā) is an administrative division of an Indian state or territory. In some cases districts are further subdivided into sub-divisions, and in others directly into tehsils or talukas. As of 2021 there are a total of 748 districts, up from the 640 in the 2011 Census of India and the 593 recorded in the 2001 Census of India.[1]

url - https://en.wikipedia.org/wiki/Outline_of_India
paragraph - The seventh-largest country by area, India is located on the Indian subcontinent in South Asia. India was home to the ancient Indus Valley Civilisation, and is the birthplace of four world religions: Hinduism, Sikhism, Buddhism, Jainism. India endured colonisation, eventually being administered by the United Kingdom from the mid-19th century to the mid-20th century. India became an independent nation in 1947 after a struggle for independence that was mainly non-violent resistance, led by influential figures like Mahatma Gandhi, and underwent a violent partition. India is the second most populous country with over 1.4 billion people, and is also the most populous democracy in the world.

url - https://en.wikipedia.org/wiki/Punjab,_India
paragraph - Punjab (/pʌnˈdʒɑːb/ (listen);[7] Punjabi: [pənˈdʒɑːb]) is a state in northern India. Forming part of the larger Punjab region of the Indian subcontinent, the state is bordered by the Indian states of Himachal Pradesh to the north and northeast, Haryana to the south and southeast, and Rajasthan to the southwest, by the Indian union territory of Chandigarh to the east, and by Jammu and Kashmir to the north. It is bordered by Punjab, a province of Pakistan to the west.[8] The state covers an area of 50,362 square kilometres (19,445 square miles), 1.53% of India's total geographical area.[9] It is the 20th-largest Indian state by area. With over 27 million inhabitants, Punjab is the 16th-largest state by population, comprising 23 districts.[2] Punjabi, written in the Gurmukhi script, is the most widely spoken and official language of the state.[10] The main ethnic group are the Punjabis, with Sikhs and Hindus as the dominant religious groups.[11] The state capital is Chandigarh, a union territory and also the capital of the neighbouring state of Haryana. The five tributary rivers of the Indus River from which the region took its name are the Sutlej, Ravi, Beas, Chenab and Jhelum rivers; the Sutlej, Ravi and Beas rivers flow through the Indian Punjab.[12]

url - https://en.wikipedia.org/wiki/Reservation_in_India
paragraph - Reservation is a system in India that provides scholarship, concession in fees, 49.5% seats in educational institutions (upto 64.5% in higher medical education), jobs, and relaxation in qualifying exams, relaxation in age to certain castes. This system continues after almost 70 years of independence. The motive of reservation was representation in education, employment and politics. Based on provisions in the Indian Constitution, it allows the Union Government and also the States and Territories of India to set reserved quotas or seats, which lower the qualifications needed in exams, job openings and etc. for "socially and educationally backward citizens."[1][2]

url - https://en.wikipedia.org/wiki/National_Stock_Exchange_of_India
paragraph - National Stock Exchange of India Limited (NSE) is the leading stock exchange of India, located in Mumbai, Maharashtra. It is world’s largest derivatives exchange in 2021 by number of contracts traded based on the statistics maintained by Futures Industry Association (FIA), a derivatives trade body. NSE is ranked 4th in the world in cash equities by number of trades as per the statistics maintained by the World Federation of Exchanges (WFE) for the calendar year 2021. It is under the ownership of some leading financial institutions, banks, and insurance companies.[5] NSE was established in 1992 as the first dematerialized electronic exchange in the country. NSE was the first exchange in the country to provide a modern, fully automated screen-based electronic trading system that offered easy trading facilities to investors spread across the length and breadth of the country. Vikram Limaye is the Managing Director and Chief Executive Officer of NSE.

url - https://en.wikipedia.org/wiki/India_national_under-19_cricket_team
paragraph - The Indian Under-19 cricket team represents the nation of India in cricket at Under-19 level. The team has won five Under-19 World Cups and has the best win percentage in ODIs (77%) among all Under-19 national teams.[1]

url - https://en.wikipedia.org/wiki/List_of_political_parties_in_India
paragraph - India has a multi-party system. The Election Commission of India (ECI) accords recognition to the national level and the state level political parties based upon objective criteria. A recognised political party enjoys privileges like a reserved party symbol,[a] free broadcast time on state-run television and radio, consultation in the setting of election dates, and giving input in setting electoral rules and regulations. Other political parties that wish to contest local, state or national elections are required to be registered by the Election Commission of India.  Registered Parties are upgraded as recognised National Party or State Party by the ECI if they meet the relevant criteria after a Lok Sabha or State legislative assembly election. The Recognised Party status is reviewed periodically by the ECI. 

url - https://en.wikipedia.org/wiki/Make_in_India
paragraph - Make in India is an initiative by the Government of India to make and encourage companies to develop, manufacture and assemble products made in India and incentivize dedicated investments into manufacturing.[1] The policy approach was to create a conducive environment for investments, develop a modern and efficient infrastructure, and open up new sectors for foreign capital. The initiative targeted 25 economic sectors for job creation and skill enhancement,[2] and aimed "to transform India into a global design and manufacturing export hub."[3][4]

url - https://en.wikipedia.org/wiki/Union_territory
paragraph - A union territory (Hindi: केन्द्र-शासित प्रदेश, romanized: kendr-shaasit pradesh, lit. 'centrally administered province') is a type of administrative division in the Republic of India. Unlike the states of India, which have their own governments, union territories are federal territories governed, in part or in whole, by the Union Government of India.[1][2][3] There are currently eight union territories of India.

url - https://en.wikipedia.org/wiki/Union_territories_of_India
paragraph - A union territory (Hindi: केन्द्र-शासित प्रदेश, romanized: kendr-shaasit pradesh, lit. 'centrally administered province') is a type of administrative division in the Republic of India. Unlike the states of India, which have their own governments, union territories are federal territories governed, in part or in whole, by the Union Government of India.[1][2][3] There are currently eight union territories of India.

url - https://en.wikipedia.org/wiki/India_Post
paragraph - India Post is a government operated postal system in India, which is under the jurisdiction of Department of Post, Ministry of Communications of the Government of India. Generally called "the Post Office" in India, it is the most widely distributed postal system in the world. Warren Hastings had taken initiative under East India Company to start the Postal Service in the country in 1766. It was initially established under the name "Company Mail". It was later modified into a service under the Crown in 1854 by Lord Dalhousie. Dalhousie introduced uniform postage rates (universal service) and helped to pass the India Post Office Act 1854 which significantly improved upon 1837 Post Office act which had introduced regular post offices in India.[6] It created the position Director General of Post for the whole country.[7][8]

url - https://en.wikipedia.org/wiki/India%E2%80%93Pakistan_relations
paragraph - India–Pakistan relations (Hindi: भारत-पाकिस्तान सम्बन्ध; Urdu: بھارت پاکستان تعلقات) refer to the bilateral relations between the Republic of India and the Islamic Republic of Pakistan. The relations between the two countries have been complex and largely hostile due to a number of historical and political events. Relations between the two states have been defined by the violent partition of British India in 1947 which started the Kashmir conflict, and the numerous military conflicts fought between the two nations. Consequently, their relationship has been plagued by hostility and suspicion. Northern India and Pakistan somewhat overlap in certain demographics and shared lingua francas (mainly Punjabi, Sindhi, and Hindustani).

url - https://en.wikipedia.org/wiki/2022_elections_in_India
paragraph - Elections in India in 2022 will include election to the office of the president of India, vice president of India, by-elections to the Lok Sabha, elections to the Rajya Sabha, elections to state legislative assemblies of 7 (seven) states, by-elections to state legislative assemblies and numerous other elections and by-elections to state legislative councils and local bodies.[1]

url - https://en.wikipedia.org/wiki/Indian_independence_movement
paragraph - The Indian independence movement was a series of historic events with the ultimate aim of ending British rule in India. It lasted from 1857 to 1947.[1]

url - https://en.wikipedia.org/wiki/India%27s_Independence_Movement
paragraph - The Indian independence movement was a series of historic events with the ultimate aim of ending British rule in India. It lasted from 1857 to 1947.[1]

url - https://en.wikipedia.org/wiki/List_of_amendments_of_the_Constitution_of_India
paragraph - As of October 2021, there have been 105[1] amendments of the Constitution of India since it was first enacted in 1950.[2]

url - https://en.wikipedia.org/wiki/List_of_chief_justices_of_India
paragraph - There are a total of 48 chief justices of India that have served since the establishment of the Supreme Court of India in 1950, which superseded the Federal Court of India. The current Incumbent and 48th chief justice of India is Nuthalapati Venkata Ramana, who entered office on 24 April 2021. Based on the convention of seniority, the seven next chief justices can be predicted.[1]

url - https://en.wikipedia.org/wiki/Prostitution_in_India
paragraph - Prostitution is legal in India.[1] A number of related activities including soliciting, kerb crawling, owning or managing a brothel, prostitution in a hotel,[2] child prostitution, pimping and pandering[3] are illegal.[4][5] There are, however, many brothels illegally operating in Indian cities including Mumbai, Delhi, Kolkata, Bangalore, and Chennai.[6] UNAIDS estimate there were 657,829 prostitutes in the country as of 2016.[7] Other unofficial estimates have calculated India has roughly 3–10 million prostitutes.[8][9]  India is widely regarded as having one of the world's largest commercial sex industry.[10][11][12][13] It has emerged as a global hub of sex tourism, attracting sex tourists from wealthy countries.[13][11][14][15] The sex industry in India is a multi-billion dollar one, and one of the fastest growing.[16][17][18]

url - https://en.wikipedia.org/wiki/Indian_subcontinent
paragraph - The Indian subcontinent, or simply the subcontinent, is a physiographical region in South Asia. It is situated on the Indian Plate, projecting southwards into the Indian Ocean from the Himalayas. It generally includes the countries of Bangladesh, Bhutan, India, Maldives, Nepal, Pakistan, and Sri Lanka.[1][2][3][4] Sometimes, the British Indian Ocean Territory is also included. The terms Indian subcontinent and South Asia are often used interchangeably to denote the region, although the geopolitical term of South Asia frequently includes Afghanistan.[5] The United Nations geoscheme for Asia also includes Iran in Southern Asia.

url - https://en.wikipedia.org/wiki/India_(subcontinent)
paragraph - The Indian subcontinent, or simply the subcontinent, is a physiographical region in South Asia. It is situated on the Indian Plate, projecting southwards into the Indian Ocean from the Himalayas. It generally includes the countries of Bangladesh, Bhutan, India, Maldives, Nepal, Pakistan, and Sri Lanka.[1][2][3][4] Sometimes, the British Indian Ocean Territory is also included. The terms Indian subcontinent and South Asia are often used interchangeably to denote the region, although the geopolitical term of South Asia frequently includes Afghanistan.[5] The United Nations geoscheme for Asia also includes Iran in Southern Asia.

url - https://en.wikipedia.org/wiki/Forestry_in_India
paragraph - Forestry in India is a significant rural industry and a major environmental resource. India is one of the ten most forest-rich countries of the world. Together, India and these other 9 countries account for 67 percent of total forest area of the world.[1] India's forest cover grew at 0.20% annually over 1990–2000,[2] and has grown at the rate of 0.7% per year over 2000–2010,[2] after decades where forest degradation was a matter of serious concern.[3]

url - https://en.wikipedia.org/wiki/Crime_in_India
paragraph - Crime in India has been recorded since the British Raj, with comprehensive statistics now compiled annually by the National Crime Records Bureau (NCRB), under the  Ministry of Home Affairs (India) (MHA).

url - https://en.wikipedia.org/wiki/Indian_Standard_Time
paragraph - Indian Standard Time (IST), sometimes also called India Standard Time, is the time zone observed throughout India, with a time offset of UTC+05:30. India does not observe daylight saving time or other seasonal adjustments. In military and aviation time IST is designated E* ("Echo-Star").[1] It is indicated as Asia/Kolkata in the IANA time zone database. 

url - https://en.wikipedia.org/wiki/India_Daylight_Time
paragraph - Indian Standard Time (IST), sometimes also called India Standard Time, is the time zone observed throughout India, with a time offset of UTC+05:30. India does not observe daylight saving time or other seasonal adjustments. In military and aviation time IST is designated E* ("Echo-Star").[1] It is indicated as Asia/Kolkata in the IANA time zone database. 

url - https://en.wikipedia.org/wiki/Christianity_in_India
paragraph - Protestant denominations
Andhra Evangelical Lutheran, Assemblies Jehovah Shammah, Christian Revival Church, Church of North India, Church of South India, Garo Baptist, Indian Brethren, Indian Pentecostal Church of God, Church of God (Full Gospel), North Bank Baptist Christian, Northern Evangelical Lutheran, Methodist Church, Presbyterian, The Pentecostal Mission, Seventh-day Adventist, United Evangelical Lutheran

url - https://en.wikipedia.org/wiki/Administrative_divisions_of_India
paragraph - The administrative divisions of India are subnational administrative units of India; they are composed of a nested hierarchy of country subdivisions.

url - https://en.wikipedia.org/wiki/List_of_banks_in_India
paragraph - 

This is the list of banks which are listed as scheduled banks under second schedule of RBI Act, 1934.[1]

url - https://en.wikipedia.org/wiki/Borders_of_India
paragraph - India shares borders with several sovereign countries; it shares land borders with China, Bhutan, Nepal, Pakistan, Bangladesh and Myanmar.[1] Bangladesh and Pakistan share both land borders as well as maritime borders, while Sri Lanka shares only a maritime border though Ram setu. India's Andaman and Nicobar Islands share a maritime border with Thailand, Myanmar and Indonesia.

url - https://en.wikipedia.org/wiki/Kia_India
paragraph - Kia India Private Limited is a subsidiary of Kia for its operations in India. The company was founded on 19 May 2017[2] following an announcement of the construction of a new 536-acre manufacturing facility in Anantapur District, Andhra Pradesh. The plant started its trial production in January 2019[3] and the mass production of its first product, the Kia Seltos started on 31 July 2019.[4] The US$2 billion manufacturing plant is capable of producing 300,000 vehicles annually.[5]

url - https://en.wikipedia.org/wiki/Panchayati_raj_in_India
paragraph - Panchayati Raj (Council of five officials) is the system of local self-government of villages in rural India[1] as opposed to urban and suburban municipalities.

url - https://en.wikipedia.org/wiki/Army_ranks_and_insignia_of_India
paragraph - Indian Army Ranks can be broadly classified into three categories: Commissioned Officers, Junior Commissioned Officers and Other Ranks.

url - https://en.wikipedia.org/wiki/List_of_languages_by_number_of_native_speakers_in_India
paragraph - India is home to several hundred languages. Most Indians speak a language belonging to the families of the Indo-Aryan branch of Indo-European (c. 77%), the Dravidian (c. 20.61%), the Austroasiatic (Munda) (c. 1.2%), or the Sino-Tibetan (c. 0.8%), with some languages of the Himalayas still unclassified. The SIL Ethnologue lists 415 living languages for India.

url - https://en.wikipedia.org/wiki/Pathans_in_India
paragraph - Pathans in India are citizens or residents of India who are of ethnic Pashtun ancestry. "Pathan" is the local Hindi-Urdu term for an individual who belongs to the Pashtun ethnic group, or descends from it.[6][7] The term additionally finds mention among Western sources, mainly in the colonial-era literature of British India.[8][9] Historically, the term "Afghan" was also synonymous with the Pathans.[10] The Pathans originate from the region straddling Pakistan and Afghanistan.[11][12]

url - https://en.wikipedia.org/wiki/List_of_subdistricts_in_India
paragraph - India uses a plethora of terms to denote the large number of subdistricts across its  28 states and 8 union territories. The most commonly used term, prevalent across states in North India and widely used by the union government is tehsil. Other terms such as taluks, subdivisions, mandals, circles are officially used in the administration of respective states. The current terms have replaced earlier geographical terms, such as pargana and thana.[1]

url - https://en.wikipedia.org/wiki/Communist_Party_of_India_(Marxist)
paragraph - The Communist Party of India (Marxist)  (abbreviated as CPI(M)/CPIM/CPM) is a communist political party in India.[2] It is one of the national parties of India.[4] The party emerged from a split from the Communist Party of India (CPI) on 7 November, 1964.

url - https://en.wikipedia.org/wiki/New_Delhi
paragraph - New Delhi (/ˈdɛli/ (listen),[5] Hindi: [ˈnəiː ˈdɪlːiː] Naī Dillī) is the capital of India and a part of the National Capital Territory of Delhi (NCT). New Delhi is the seat of all three branches of the government of India, hosting the Rashtrapati Bhavan, Parliament House, and the Supreme Court of India. New Delhi is a municipality within the NCT, administrated by the NDMC, which covers mostly Lutyens' Delhi and a few adjacent areas. The municipal area is part of a larger administrative district, the New Delhi district.

url - https://en.wikipedia.org/wiki/New_Delhi,_India
paragraph - New Delhi (/ˈdɛli/ (listen),[5] Hindi: [ˈnəiː ˈdɪlːiː] Naī Dillī) is the capital of India and a part of the National Capital Territory of Delhi (NCT). New Delhi is the seat of all three branches of the government of India, hosting the Rashtrapati Bhavan, Parliament House, and the Supreme Court of India. New Delhi is a municipality within the NCT, administrated by the NDMC, which covers mostly Lutyens' Delhi and a few adjacent areas. The municipal area is part of a larger administrative district, the New Delhi district.

